#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/ChrisWilding/terraform-github/runs/run-mioTe29MfLtdV1WW

Waiting for the plan to start...

Terraform v1.1.5
on linux_amd64
Initializing plugins and modules...
github_repository.exercism_kotlin: Refreshing state... [id=exercism-kotlin]
github_repository.mazes_for_programmers: Refreshing state... [id=mazes-for-programmers]
github_repository.advent_of_code_2018: Refreshing state... [id=advent-of-code-2018]
github_repository.dlog: Refreshing state... [id=dlog]
github_repository.exercism_erlang: Refreshing state... [id=exercism-erlang]
github_repository.exercism_typescript: Refreshing state... [id=exercism-typescript]
github_repository.pact_broker: Refreshing state... [id=pact-broker]
github_repository.ginventory: Refreshing state... [id=ginventory]
github_repository.experiment_aurora_lambda: Refreshing state... [id=experiment-aurora-lambda]
github_repository.exercism_ocaml: Refreshing state... [id=exercism-ocaml]
github_repository.advent_of_code_2019: Refreshing state... [id=advent-of-code-2019]
github_repository.go_base: Refreshing state... [id=go-base]
github_repository.fsa: Refreshing state... [id=fsa]
github_repository.experiment_kafka: Refreshing state... [id=experiment-kafka]
github_repository.dotfiles: Refreshing state... [id=dotfiles]
github_repository.exercism_rust: Refreshing state... [id=exercism-rust]
github_repository.terraform_aws_secrets: Refreshing state... [id=terraform-aws-secrets]
github_repository.nasa: Refreshing state... [id=nasa]
github_repository.experiment_io_ts: Refreshing state... [id=experiment-io-ts]
github_repository.advent_of_code_2017: Refreshing state... [id=advent-of-code-2017]
github_repository.jlox: Refreshing state... [id=jlox]
github_repository.crawl: Refreshing state... [id=crawl]
github_repository.www_chriswilding_dev: Refreshing state... [id=www.chriswilding.dev]
github_repository.magidash: Refreshing state... [id=magidash]
github_repository.tiger_go: Refreshing state... [id=tiger-go]
github_repository.curriculum_vitae: Refreshing state... [id=curriculum-vitae]
github_repository.advent_of_code_2020: Refreshing state... [id=advent-of-code-2020]
github_repository.exercism_scala: Refreshing state... [id=exercism-scala]
github_repository.discography_api: Refreshing state... [id=discography-api]
github_repository.monkey: Refreshing state... [id=monkey]
github_repository.advent_of_code_2021: Refreshing state... [id=advent-of-code-2021]
github_repository.merchants_guide_to_the_galaxy: Refreshing state... [id=merchants-guide-to-the-galaxy]
github_repository.jinventory: Refreshing state... [id=jinventory]
github_repository.exercism_java: Refreshing state... [id=exercism-java]
github_repository.exercism_go: Refreshing state... [id=exercism-go]
github_repository.exercism_x86_64_assembly: Refreshing state... [id=exercism-x86-64-assembly]
github_repository.terraform_github: Refreshing state... [id=terraform-github]
github_repository.exercism_mips: Refreshing state... [id=exercism-mips]
github_repository.organisation_accounts_client: Refreshing state... [id=organisation-accounts-client]
github_repository.spring_microservices_in_action: Refreshing state... [id=spring-microservices-in-action]
github_repository.aws_nuke: Refreshing state... [id=aws-nuke]
github_repository.nand2tetris: Refreshing state... [id=nand2tetris]
github_repository.canvas: Refreshing state... [id=canvas]
github_repository.hotels: Refreshing state... [id=hotels]
github_repository.terraform_aws: Refreshing state... [id=terraform-aws]
github_repository.bookshelf_api: Refreshing state... [id=bookshelf-api]
github_repository.bump: Refreshing state... [id=bump]
github_repository.bill: Refreshing state... [id=bill]
github_repository.pact_broker_secrets: Refreshing state... [id=pact-broker-secrets]
github_repository.sahi: Refreshing state... [id=sahi]
github_repository.exercism_c: Refreshing state... [id=exercism-c]
github_repository.tiger_ocaml: Refreshing state... [id=tiger-ocaml]
github_repository.clox: Refreshing state... [id=clox]
github_repository.to_roman_numeral: Refreshing state... [id=to-roman-numeral]
github_repository.exercism_elixir: Refreshing state... [id=exercism-elixir]
github_repository.experiment_autotag: Refreshing state... [id=experiment-autotag]
github_branch_protection.mazes_for_programmers: Refreshing state... [id=MDIwOkJyYW5jaFByb3RlY3Rpb25SdWxlMjE2NjcxMzE=]
github_branch_protection.go_base: Refreshing state... [id=BPR_kwDOG6o6fs4BdUt4]
github_actions_secret.go_base_heroku_api_key: Refreshing state... [id=go-base:HEROKU_API_KEY]
github_actions_secret.go_base_terraform_cloud_api_key: Refreshing state... [id=go-base:TERRAFORM_CLOUD_API_KEY]
github_branch_protection.crawl: Refreshing state... [id=BPR_kwDOG9mVlc4BdzBc]
github_actions_secret.magidash_heroku_api_key: Refreshing state... [id=magidash:HEROKU_API_KEY]
github_branch_protection.jinventory: Refreshing state... [id=MDIwOkJyYW5jaFByb3RlY3Rpb25SdWxlMjE3NDU0ODk=]
github_actions_secret.heroku_api_key: Refreshing state... [id=jinventory:HEROKU_API_KEY]
github_actions_secret.terraform_cloud_api_key: Refreshing state... [id=terraform-github:TERRAFORM_CLOUD_API_KEY]
github_branch_protection.terraform_github: Refreshing state... [id=BPR_kwDOFtzSP84BciXm]
github_branch_protection.organisation_accounts_client: Refreshing state... [id=BPR_kwDOG_uO484Bf4-u]
github_actions_secret.aws_secret_access_key: Refreshing state... [id=aws-nuke:AWS_SECRET_ACCESS_KEY]
github_actions_secret.aws_access_key_id: Refreshing state... [id=aws-nuke:AWS_ACCESS_KEY_ID]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # github_repository.advent_of_code_2017 has changed
  ~ resource "github_repository" "advent_of_code_2017" {
      ~ allow_auto_merge       = true -> false
      ~ allow_rebase_merge     = true -> false
      ~ allow_squash_merge     = true -> false
      ~ delete_branch_on_merge = true -> false
      ~ etag                   = "W/\"9fa098119dfdf7ad844fbb19431d4aee40029c9200dd9b149f8feee958df4544\"" -> "W/\"38365ee3d3bcdfb9dc9c984be9c55e499a6553b42787dc6c87828238fd2642d2\""
      ~ full_name              = "ChrisWilding/advent-of-code-2017" -> "chriswilding/advent-of-code-2017"
      ~ git_clone_url          = "git://github.com/ChrisWilding/advent-of-code-2017.git" -> "git://github.com/chriswilding/advent-of-code-2017.git"
      ~ html_url               = "https://github.com/ChrisWilding/advent-of-code-2017" -> "https://github.com/chriswilding/advent-of-code-2017"
      ~ http_clone_url         = "https://github.com/ChrisWilding/advent-of-code-2017.git" -> "https://github.com/chriswilding/advent-of-code-2017.git"
        id                     = "advent-of-code-2017"
        name                   = "advent-of-code-2017"
      ~ ssh_clone_url          = "git@github.com:ChrisWilding/advent-of-code-2017.git" -> "git@github.com:chriswilding/advent-of-code-2017.git"
      ~ svn_url                = "https://github.com/ChrisWilding/advent-of-code-2017" -> "https://github.com/chriswilding/advent-of-code-2017"
      ~ vulnerability_alerts   = true -> false
        # (19 unchanged attributes hidden)
    }

  # github_repository.advent_of_code_2018 has changed
  ~ resource "github_repository" "advent_of_code_2018" {
      ~ allow_auto_merge       = true -> false
      ~ allow_rebase_merge     = true -> false
      ~ allow_squash_merge     = true -> false
      ~ delete_branch_on_merge = true -> false
      ~ etag                   = "W/\"f3213b8e8b1e17995b6cf10509ba35d5d0d88a63029fb163483a2a0e9e07f392\"" -> "W/\"3409b852f892c36a169476c017dcf5b2b3b1c62790a214453e2c6b49c1000f36\""
      ~ full_name              = "ChrisWilding/advent-of-code-2018" -> "chriswilding/advent-of-code-2018"
      ~ git_clone_url          = "git://github.com/ChrisWilding/advent-of-code-2018.git" -> "git://github.com/chriswilding/advent-of-code-2018.git"
      ~ html_url               = "https://github.com/ChrisWilding/advent-of-code-2018" -> "https://github.com/chriswilding/advent-of-code-2018"
      ~ http_clone_url         = "https://github.com/ChrisWilding/advent-of-code-2018.git" -> "https://github.com/chriswilding/advent-of-code-2018.git"
        id                     = "advent-of-code-2018"
        name                   = "advent-of-code-2018"
      ~ ssh_clone_url          = "git@github.com:ChrisWilding/advent-of-code-2018.git" -> "git@github.com:chriswilding/advent-of-code-2018.git"
      ~ svn_url                = "https://github.com/ChrisWilding/advent-of-code-2018" -> "https://github.com/chriswilding/advent-of-code-2018"
      ~ vulnerability_alerts   = true -> false
        # (19 unchanged attributes hidden)
    }

  # github_repository.advent_of_code_2019 has changed
  ~ resource "github_repository" "advent_of_code_2019" {
      ~ allow_auto_merge       = true -> false
      ~ allow_rebase_merge     = true -> false
      ~ allow_squash_merge     = true -> false
      ~ delete_branch_on_merge = true -> false
      ~ etag                   = "W/\"4f1bab98eaf163d87dbd88980f628c2e3b862963f7101dd345fae9f8198a2f8c\"" -> "W/\"b39cbc1cf2798445927373ab712360c3ade5da21f6bf843a941f35ec24972705\""
      ~ full_name              = "ChrisWilding/advent-of-code-2019" -> "chriswilding/advent-of-code-2019"
      ~ git_clone_url          = "git://github.com/ChrisWilding/advent-of-code-2019.git" -> "git://github.com/chriswilding/advent-of-code-2019.git"
      ~ html_url               = "https://github.com/ChrisWilding/advent-of-code-2019" -> "https://github.com/chriswilding/advent-of-code-2019"
      ~ http_clone_url         = "https://github.com/ChrisWilding/advent-of-code-2019.git" -> "https://github.com/chriswilding/advent-of-code-2019.git"
        id                     = "advent-of-code-2019"
        name                   = "advent-of-code-2019"
      ~ ssh_clone_url          = "git@github.com:ChrisWilding/advent-of-code-2019.git" -> "git@github.com:chriswilding/advent-of-code-2019.git"
      ~ svn_url                = "https://github.com/ChrisWilding/advent-of-code-2019" -> "https://github.com/chriswilding/advent-of-code-2019"
      ~ vulnerability_alerts   = true -> false
        # (19 unchanged attributes hidden)
    }

  # github_repository.advent_of_code_2020 has changed
  ~ resource "github_repository" "advent_of_code_2020" {
      ~ allow_auto_merge       = true -> false
      ~ allow_rebase_merge     = true -> false
      ~ allow_squash_merge     = true -> false
      ~ delete_branch_on_merge = true -> false
      ~ etag                   = "W/\"e3efd0c7c5c2bbc25766dc74577a20327f6d512433a9f213bcdc3cee16d07fdc\"" -> "W/\"4b052b5f5c1d1472a50ecb024edf4bf3272fee2b5342aa8b9c536820661c1e24\""
      ~ full_name              = "ChrisWilding/advent-of-code-2020" -> "chriswilding/advent-of-code-2020"
      ~ git_clone_url          = "git://github.com/ChrisWilding/advent-of-code-2020.git" -> "git://github.com/chriswilding/advent-of-code-2020.git"
      ~ html_url               = "https://github.com/ChrisWilding/advent-of-code-2020" -> "https://github.com/chriswilding/advent-of-code-2020"
      ~ http_clone_url         = "https://github.com/ChrisWilding/advent-of-code-2020.git" -> "https://github.com/chriswilding/advent-of-code-2020.git"
        id                     = "advent-of-code-2020"
        name                   = "advent-of-code-2020"
      ~ ssh_clone_url          = "git@github.com:ChrisWilding/advent-of-code-2020.git" -> "git@github.com:chriswilding/advent-of-code-2020.git"
      ~ svn_url                = "https://github.com/ChrisWilding/advent-of-code-2020" -> "https://github.com/chriswilding/advent-of-code-2020"
      ~ vulnerability_alerts   = true -> false
        # (19 unchanged attributes hidden)
    }

  # github_repository.bill has changed
  ~ resource "github_repository" "bill" {
      ~ allow_auto_merge       = true -> false
      ~ allow_rebase_merge     = true -> false
      ~ allow_squash_merge     = true -> false
      ~ delete_branch_on_merge = true -> false
      ~ etag                   = "W/\"e2c34bf450adbcbc3abd0510b0fddc29e3a47a45030c87d381444184da89a823\"" -> "W/\"3ab12ab0a362ab32c57bd1b00046b2e4e5c886b2730cdd82a1e7fc6d0543815b\""
      ~ full_name              = "ChrisWilding/bill" -> "chriswilding/bill"
      ~ git_clone_url          = "git://github.com/ChrisWilding/bill.git" -> "git://github.com/chriswilding/bill.git"
      ~ html_url               = "https://github.com/ChrisWilding/bill" -> "https://github.com/chriswilding/bill"
      ~ http_clone_url         = "https://github.com/ChrisWilding/bill.git" -> "https://github.com/chriswilding/bill.git"
        id                     = "bill"
        name                   = "bill"
      ~ ssh_clone_url          = "git@github.com:ChrisWilding/bill.git" -> "git@github.com:chriswilding/bill.git"
      ~ svn_url                = "https://github.com/ChrisWilding/bill" -> "https://github.com/chriswilding/bill"
      ~ vulnerability_alerts   = true -> false
        # (17 unchanged attributes hidden)
    }

  # github_repository.canvas has changed
  ~ resource "github_repository" "canvas" {
      ~ allow_auto_merge       = true -> false
      ~ allow_rebase_merge     = true -> false
      ~ allow_squash_merge     = true -> false
      ~ delete_branch_on_merge = true -> false
      ~ etag                   = "W/\"78d12478ed6aed91b0fbdf5d16ba325f9931ee32e9a9172b05f0e21bd6b18760\"" -> "W/\"a423a689efbec623e789f47aa8796323995ea1207ce911da48ce404a4a017823\""
      ~ full_name              = "ChrisWilding/canvas" -> "chriswilding/canvas"
      ~ git_clone_url          = "git://github.com/ChrisWilding/canvas.git" -> "git://github.com/chriswilding/canvas.git"
      ~ html_url               = "https://github.com/ChrisWilding/canvas" -> "https://github.com/chriswilding/canvas"
      ~ http_clone_url         = "https://github.com/ChrisWilding/canvas.git" -> "https://github.com/chriswilding/canvas.git"
        id                     = "canvas"
        name                   = "canvas"
      ~ ssh_clone_url          = "git@github.com:ChrisWilding/canvas.git" -> "git@github.com:chriswilding/canvas.git"
      ~ svn_url                = "https://github.com/ChrisWilding/canvas" -> "https://github.com/chriswilding/canvas"
      ~ vulnerability_alerts   = true -> false
        # (16 unchanged attributes hidden)
    }

  # github_repository.dlog has changed
  ~ resource "github_repository" "dlog" {
      ~ etag                   = "W/\"1baf6f7672d27eb55edcabe84e11f79ddc5b47066897f06cf2f9166bf4ed4780\"" -> "W/\"70b83368acd43b9c798a25589dce3f3b63c6cf90e2c095de39639ffccfc0144a\""
        id                     = "dlog"
        name                   = "dlog"
      + topics                 = []
        # (27 unchanged attributes hidden)
    }

  # github_repository.exercism_scala has changed
  ~ resource "github_repository" "exercism_scala" {
      ~ etag                   = "W/\"1ae4f5c50732d6d8109ac6a7a6bfff4e4187dcfffcd633cabc513d0220e3a18f\"" -> "W/\"e790e633e489a5a7cad671805e227a39f0b5619cdf170e727edd2290787567a8\""
      ~ full_name              = "ChrisWilding/exercism-scala" -> "chriswilding/exercism-scala"
      ~ git_clone_url          = "git://github.com/ChrisWilding/exercism-scala.git" -> "git://github.com/chriswilding/exercism-scala.git"
      ~ html_url               = "https://github.com/ChrisWilding/exercism-scala" -> "https://github.com/chriswilding/exercism-scala"
      ~ http_clone_url         = "https://github.com/ChrisWilding/exercism-scala.git" -> "https://github.com/chriswilding/exercism-scala.git"
        id                     = "exercism-scala"
        name                   = "exercism-scala"
      ~ ssh_clone_url          = "git@github.com:ChrisWilding/exercism-scala.git" -> "git@github.com:chriswilding/exercism-scala.git"
      ~ svn_url                = "https://github.com/ChrisWilding/exercism-scala" -> "https://github.com/chriswilding/exercism-scala"
        # (24 unchanged attributes hidden)
    }

  # github_repository.fsa has changed
  ~ resource "github_repository" "fsa" {
      ~ allow_auto_merge       = true -> false
      ~ allow_rebase_merge     = true -> false
      ~ allow_squash_merge     = true -> false
      ~ delete_branch_on_merge = true -> false
      ~ etag                   = "W/\"68311cc3875aa9043d8f1908d9110db1ffcd228e09911628a680bfb5497ca764\"" -> "W/\"3476a787aaa41e3c99b9fe31090c638559a6eb8a3f99ee1a486b825cf0eec8da\""
      ~ full_name              = "ChrisWilding/fsa" -> "chriswilding/fsa"
      ~ git_clone_url          = "git://github.com/ChrisWilding/fsa.git" -> "git://github.com/chriswilding/fsa.git"
      ~ html_url               = "https://github.com/ChrisWilding/fsa" -> "https://github.com/chriswilding/fsa"
      ~ http_clone_url         = "https://github.com/ChrisWilding/fsa.git" -> "https://github.com/chriswilding/fsa.git"
        id                     = "fsa"
        name                   = "fsa"
      ~ ssh_clone_url          = "git@github.com:ChrisWilding/fsa.git" -> "git@github.com:chriswilding/fsa.git"
      ~ svn_url                = "https://github.com/ChrisWilding/fsa" -> "https://github.com/chriswilding/fsa"
      ~ vulnerability_alerts   = true -> false
        # (17 unchanged attributes hidden)
    }

  # github_repository.hotels has changed
  ~ resource "github_repository" "hotels" {
      ~ allow_auto_merge       = true -> false
      ~ allow_rebase_merge     = true -> false
      ~ allow_squash_merge     = true -> false
      ~ delete_branch_on_merge = true -> false
      ~ etag                   = "W/\"2c3fd14381e53917d59fc5fe2b64face6d35fcec37d1d0976567cf8ebc41e59a\"" -> "W/\"4ebbff40cd7561847e4025bfd45dfe6cb7249290bfc8f77754fc86cfcc95ac67\""
      ~ full_name              = "ChrisWilding/hotels" -> "chriswilding/hotels"
      ~ git_clone_url          = "git://github.com/ChrisWilding/hotels.git" -> "git://github.com/chriswilding/hotels.git"
      ~ html_url               = "https://github.com/ChrisWilding/hotels" -> "https://github.com/chriswilding/hotels"
      ~ http_clone_url         = "https://github.com/ChrisWilding/hotels.git" -> "https://github.com/chriswilding/hotels.git"
        id                     = "hotels"
        name                   = "hotels"
      ~ ssh_clone_url          = "git@github.com:ChrisWilding/hotels.git" -> "git@github.com:chriswilding/hotels.git"
      ~ svn_url                = "https://github.com/ChrisWilding/hotels" -> "https://github.com/chriswilding/hotels"
      ~ vulnerability_alerts   = true -> false
        # (17 unchanged attributes hidden)
    }

  # github_repository.merchants_guide_to_the_galaxy has changed
  ~ resource "github_repository" "merchants_guide_to_the_galaxy" {
      ~ allow_auto_merge       = true -> false
      ~ allow_rebase_merge     = true -> false
      ~ allow_squash_merge     = true -> false
      ~ delete_branch_on_merge = true -> false
      ~ etag                   = "W/\"4bc564a508f87eff1aef38c979550aa2af1eb46a05b591238831cc65c5d6c7fc\"" -> "W/\"207a5943277cedd94eee01208f98ddd252aff5dbde7e050a363b06741fc1a505\""
      ~ full_name              = "ChrisWilding/merchants-guide-to-the-galaxy" -> "chriswilding/merchants-guide-to-the-galaxy"
      ~ git_clone_url          = "git://github.com/ChrisWilding/merchants-guide-to-the-galaxy.git" -> "git://github.com/chriswilding/merchants-guide-to-the-galaxy.git"
      ~ html_url               = "https://github.com/ChrisWilding/merchants-guide-to-the-galaxy" -> "https://github.com/chriswilding/merchants-guide-to-the-galaxy"
      ~ http_clone_url         = "https://github.com/ChrisWilding/merchants-guide-to-the-galaxy.git" -> "https://github.com/chriswilding/merchants-guide-to-the-galaxy.git"
        id                     = "merchants-guide-to-the-galaxy"
        name                   = "merchants-guide-to-the-galaxy"
      ~ ssh_clone_url          = "git@github.com:ChrisWilding/merchants-guide-to-the-galaxy.git" -> "git@github.com:chriswilding/merchants-guide-to-the-galaxy.git"
      ~ svn_url                = "https://github.com/ChrisWilding/merchants-guide-to-the-galaxy" -> "https://github.com/chriswilding/merchants-guide-to-the-galaxy"
      ~ vulnerability_alerts   = true -> false
        # (18 unchanged attributes hidden)
    }

  # github_repository.nasa has changed
  ~ resource "github_repository" "nasa" {
      ~ allow_auto_merge       = true -> false
      ~ allow_rebase_merge     = true -> false
      ~ allow_squash_merge     = true -> false
      ~ delete_branch_on_merge = true -> false
      ~ etag                   = "W/\"44db0b398d732c7b76301c5382964f21db5222e2a326631f772eaa99bcea16b7\"" -> "W/\"f1e75823697a3c63e78042e3289609673ba6b80a750afd58b9790d617a8e2824\""
      ~ full_name              = "ChrisWilding/nasa" -> "chriswilding/nasa"
      ~ git_clone_url          = "git://github.com/ChrisWilding/nasa.git" -> "git://github.com/chriswilding/nasa.git"
      ~ html_url               = "https://github.com/ChrisWilding/nasa" -> "https://github.com/chriswilding/nasa"
      ~ http_clone_url         = "https://github.com/ChrisWilding/nasa.git" -> "https://github.com/chriswilding/nasa.git"
        id                     = "nasa"
        name                   = "nasa"
      ~ ssh_clone_url          = "git@github.com:ChrisWilding/nasa.git" -> "git@github.com:chriswilding/nasa.git"
      ~ svn_url                = "https://github.com/ChrisWilding/nasa" -> "https://github.com/chriswilding/nasa"
      ~ vulnerability_alerts   = true -> false
        # (19 unchanged attributes hidden)
    }

  # github_repository.sahi has changed
  ~ resource "github_repository" "sahi" {
      ~ allow_auto_merge       = true -> false
      ~ allow_rebase_merge     = true -> false
      ~ allow_squash_merge     = true -> false
      ~ delete_branch_on_merge = true -> false
      ~ etag                   = "W/\"6300b6f87f619e31cbd7620f02c0b4ea63afec752a5d171e939f6bd73b4af74d\"" -> "W/\"2452e9a89330d800dde2be2b756bc8fad71c2e15577a7bcba2da8b8232c022e2\""
      ~ full_name              = "ChrisWilding/sahi" -> "chriswilding/sahi"
      ~ git_clone_url          = "git://github.com/ChrisWilding/sahi.git" -> "git://github.com/chriswilding/sahi.git"
      ~ html_url               = "https://github.com/ChrisWilding/sahi" -> "https://github.com/chriswilding/sahi"
      ~ http_clone_url         = "https://github.com/ChrisWilding/sahi.git" -> "https://github.com/chriswilding/sahi.git"
        id                     = "sahi"
        name                   = "sahi"
      ~ ssh_clone_url          = "git@github.com:ChrisWilding/sahi.git" -> "git@github.com:chriswilding/sahi.git"
      ~ svn_url                = "https://github.com/ChrisWilding/sahi" -> "https://github.com/chriswilding/sahi"
      ~ vulnerability_alerts   = true -> false
        # (17 unchanged attributes hidden)
    }

  # github_repository.to_roman_numeral has changed
  ~ resource "github_repository" "to_roman_numeral" {
      ~ allow_auto_merge       = true -> false
      ~ allow_rebase_merge     = true -> false
      ~ allow_squash_merge     = true -> false
      ~ delete_branch_on_merge = true -> false
      ~ etag                   = "W/\"e10e9ca20181ad33cec723baf43c9679caa7b407bca15c7528fe02611d20081b\"" -> "W/\"8a08c6549d3c321ed427067e1744046139253c6bb32f9003206c2f8dd2730e05\""
      ~ full_name              = "ChrisWilding/to-roman-numeral" -> "chriswilding/to-roman-numeral"
      ~ git_clone_url          = "git://github.com/ChrisWilding/to-roman-numeral.git" -> "git://github.com/chriswilding/to-roman-numeral.git"
      ~ html_url               = "https://github.com/ChrisWilding/to-roman-numeral" -> "https://github.com/chriswilding/to-roman-numeral"
      ~ http_clone_url         = "https://github.com/ChrisWilding/to-roman-numeral.git" -> "https://github.com/chriswilding/to-roman-numeral.git"
        id                     = "to-roman-numeral"
        name                   = "to-roman-numeral"
      ~ ssh_clone_url          = "git@github.com:ChrisWilding/to-roman-numeral.git" -> "git@github.com:chriswilding/to-roman-numeral.git"
      ~ svn_url                = "https://github.com/ChrisWilding/to-roman-numeral" -> "https://github.com/chriswilding/to-roman-numeral"
      ~ vulnerability_alerts   = true -> false
        # (17 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # github_repository.advent_of_code_2017 will be updated in-place
  ~ resource "github_repository" "advent_of_code_2017" {
      ~ allow_auto_merge       = false -> true
      ~ allow_rebase_merge     = false -> true
      ~ allow_squash_merge     = false -> true
      ~ delete_branch_on_merge = false -> true
        id                     = "advent-of-code-2017"
        name                   = "advent-of-code-2017"
      ~ vulnerability_alerts   = false -> true
        # (26 unchanged attributes hidden)
    }

  # github_repository.advent_of_code_2018 will be updated in-place
  ~ resource "github_repository" "advent_of_code_2018" {
      ~ allow_auto_merge       = false -> true
      ~ allow_rebase_merge     = false -> true
      ~ allow_squash_merge     = false -> true
      ~ delete_branch_on_merge = false -> true
        id                     = "advent-of-code-2018"
        name                   = "advent-of-code-2018"
      ~ vulnerability_alerts   = false -> true
        # (26 unchanged attributes hidden)
    }

  # github_repository.advent_of_code_2019 will be updated in-place
  ~ resource "github_repository" "advent_of_code_2019" {
      ~ allow_auto_merge       = false -> true
      ~ allow_rebase_merge     = false -> true
      ~ allow_squash_merge     = false -> true
      ~ delete_branch_on_merge = false -> true
        id                     = "advent-of-code-2019"
        name                   = "advent-of-code-2019"
      ~ vulnerability_alerts   = false -> true
        # (26 unchanged attributes hidden)
    }

  # github_repository.advent_of_code_2020 will be updated in-place
  ~ resource "github_repository" "advent_of_code_2020" {
      ~ allow_auto_merge       = false -> true
      ~ allow_rebase_merge     = false -> true
      ~ allow_squash_merge     = false -> true
      ~ delete_branch_on_merge = false -> true
        id                     = "advent-of-code-2020"
        name                   = "advent-of-code-2020"
      ~ vulnerability_alerts   = false -> true
        # (26 unchanged attributes hidden)
    }

  # github_repository.bill will be updated in-place
  ~ resource "github_repository" "bill" {
      ~ allow_auto_merge       = false -> true
      ~ allow_rebase_merge     = false -> true
      ~ allow_squash_merge     = false -> true
      ~ delete_branch_on_merge = false -> true
        id                     = "bill"
        name                   = "bill"
      ~ vulnerability_alerts   = false -> true
        # (24 unchanged attributes hidden)
    }

  # github_repository.canvas will be updated in-place
  ~ resource "github_repository" "canvas" {
      ~ allow_auto_merge       = false -> true
      ~ allow_rebase_merge     = false -> true
      ~ allow_squash_merge     = false -> true
      ~ delete_branch_on_merge = false -> true
        id                     = "canvas"
        name                   = "canvas"
      ~ vulnerability_alerts   = false -> true
        # (23 unchanged attributes hidden)
    }

  # github_repository.dlog will be destroyed
  # (because github_repository.dlog is not in configuration)
  - resource "github_repository" "dlog" {
      - allow_auto_merge       = true -> null
      - allow_merge_commit     = false -> null
      - allow_rebase_merge     = true -> null
      - allow_squash_merge     = true -> null
      - archive_on_destroy     = true -> null
      - archived               = false -> null
      - auto_init              = true -> null
      - default_branch         = "main" -> null
      - delete_branch_on_merge = true -> null
      - etag                   = "W/\"70b83368acd43b9c798a25589dce3f3b63c6cf90e2c095de39639ffccfc0144a\"" -> null
      - full_name              = "chriswilding/dlog" -> null
      - git_clone_url          = "git://github.com/chriswilding/dlog.git" -> null
      - gitignore_template     = "Go" -> null
      - has_downloads          = false -> null
      - has_issues             = false -> null
      - has_projects           = false -> null
      - has_wiki               = false -> null
      - html_url               = "https://github.com/chriswilding/dlog" -> null
      - http_clone_url         = "https://github.com/chriswilding/dlog.git" -> null
      - id                     = "dlog" -> null
      - is_template            = false -> null
      - license_template       = "apache-2.0" -> null
      - name                   = "dlog" -> null
      - node_id                = "R_kgDOHhveCA" -> null
      - private                = false -> null
      - repo_id                = 505142792 -> null
      - ssh_clone_url          = "git@github.com:chriswilding/dlog.git" -> null
      - svn_url                = "https://github.com/chriswilding/dlog" -> null
      - topics                 = [] -> null
      - visibility             = "public" -> null
      - vulnerability_alerts   = true -> null
    }

  # github_repository.fsa will be updated in-place
  ~ resource "github_repository" "fsa" {
      ~ allow_auto_merge       = false -> true
      ~ allow_rebase_merge     = false -> true
      ~ allow_squash_merge     = false -> true
      ~ delete_branch_on_merge = false -> true
        id                     = "fsa"
        name                   = "fsa"
      ~ vulnerability_alerts   = false -> true
        # (24 unchanged attributes hidden)
    }

  # github_repository.hotels will be updated in-place
  ~ resource "github_repository" "hotels" {
      ~ allow_auto_merge       = false -> true
      ~ allow_rebase_merge     = false -> true
      ~ allow_squash_merge     = false -> true
      ~ delete_branch_on_merge = false -> true
        id                     = "hotels"
        name                   = "hotels"
      ~ vulnerability_alerts   = false -> true
        # (24 unchanged attributes hidden)
    }

  # github_repository.merchants_guide_to_the_galaxy will be updated in-place
  ~ resource "github_repository" "merchants_guide_to_the_galaxy" {
      ~ allow_auto_merge       = false -> true
      ~ allow_rebase_merge     = false -> true
      ~ allow_squash_merge     = false -> true
      ~ delete_branch_on_merge = false -> true
        id                     = "merchants-guide-to-the-galaxy"
        name                   = "merchants-guide-to-the-galaxy"
      ~ vulnerability_alerts   = false -> true
        # (25 unchanged attributes hidden)
    }

  # github_repository.nasa will be updated in-place
  ~ resource "github_repository" "nasa" {
      ~ allow_auto_merge       = false -> true
      ~ allow_rebase_merge     = false -> true
      ~ allow_squash_merge     = false -> true
      ~ delete_branch_on_merge = false -> true
        id                     = "nasa"
        name                   = "nasa"
      ~ vulnerability_alerts   = false -> true
        # (26 unchanged attributes hidden)
    }

  # github_repository.proglog will be created
  + resource "github_repository" "proglog" {
      + allow_auto_merge       = true
      + allow_merge_commit     = false
      + allow_rebase_merge     = true
      + allow_squash_merge     = true
      + archive_on_destroy     = true
      + archived               = false
      + auto_init              = true
      + default_branch         = (known after apply)
      + delete_branch_on_merge = true
      + etag                   = (known after apply)
      + full_name              = (known after apply)
      + git_clone_url          = (known after apply)
      + gitignore_template     = "Go"
      + has_issues             = false
      + has_projects           = false
      + has_wiki               = false
      + html_url               = (known after apply)
      + http_clone_url         = (known after apply)
      + id                     = (known after apply)
      + license_template       = "apache-2.0"
      + name                   = "proglog"
      + node_id                = (known after apply)
      + private                = (known after apply)
      + repo_id                = (known after apply)
      + ssh_clone_url          = (known after apply)
      + svn_url                = (known after apply)
      + visibility             = (known after apply)
      + vulnerability_alerts   = true
    }

  # github_repository.sahi will be updated in-place
  ~ resource "github_repository" "sahi" {
      ~ allow_auto_merge       = false -> true
      ~ allow_rebase_merge     = false -> true
      ~ allow_squash_merge     = false -> true
      ~ delete_branch_on_merge = false -> true
        id                     = "sahi"
        name                   = "sahi"
      ~ vulnerability_alerts   = false -> true
        # (24 unchanged attributes hidden)
    }

  # github_repository.to_roman_numeral will be updated in-place
  ~ resource "github_repository" "to_roman_numeral" {
      ~ allow_auto_merge       = false -> true
      ~ allow_rebase_merge     = false -> true
      ~ allow_squash_merge     = false -> true
      ~ delete_branch_on_merge = false -> true
        id                     = "to-roman-numeral"
        name                   = "to-roman-numeral"
      ~ vulnerability_alerts   = false -> true
        # (24 unchanged attributes hidden)
    }

Plan: 1 to add, 12 to change, 1 to destroy.


```

</details>

*Pusher: @chriswilding, Action: `pull_request`*